In [2]:
import pandas as pd
import numpy as np
import os
import zipfile

#### Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов. Файлы делятся на две категории:
    * Students_info_i - информация о студентах из группы i
    * Students_marks_i - оценки студентов из группы i за экзамены

#### Задание 1. 

Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата.¶

In [3]:
zip_file = zipfile.ZipFile('C:\\Users\\HP\\Documents\\python\\mag2023\\CL\\term01\\08 - NumPy, Pandas\\Data.zip', 'r')
zip_file.extractall('C:\\Users\\HP\\Documents\\python\\mag2023\\CL\\term01\\08 - NumPy, Pandas\\Data')
zip_file.close()

In [4]:
data_folder = r'C:\Users\HP\Documents\python\mag2023\CL\term01\08 - NumPy, Pandas\Data\Data'
all_files = os.listdir(data_folder)

dataframes = []
for file in all_files:
   if file.startswith('Students_info') or file.startswith('Students_marks'):
       df = pd.read_csv(os.path.join(data_folder, file))
       dataframes.append(df)

In [5]:
#your code here
df = pd.concat(dataframes, ignore_index=True)

In [6]:
df.columns

Index(['index', 'gender', 'race/ethnicity', 'parental level of education',
       'lunch', 'test preparation course', 'group', 'math score',
       'reading score', 'writing score'],
      dtype='object')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 10 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   index                        2000 non-null   int64
 1   gender                       1000 non-null   object
 2   race/ethnicity               1000 non-null   object
 3   parental level of education  1000 non-null   object
 4   lunch                        1000 non-null   object
 5   test preparation course      1000 non-null   object
 6   group                        1000 non-null   object
 7   math score                   1000 non-null   float64
 8   reading score                1000 non-null   float64
 9   writing score                1000 non-null   float64
dtypes: float64(3), int64(1), object(6)
memory usage: 156.4+ KB

#### Задание 2. 

Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы. Выведите на экран размеры полученной таблицы.

In [8]:
#your code here
df = df.drop('index', axis=1)

In [9]:
display(df.head(10))
df.shape

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,NaN,NaN,NaN
1,female,group C,some college,standard,completed,group1,NaN,NaN,NaN
2,female,group B,master's degree,standard,none,group1,NaN,NaN,NaN
3,male,group A,associate's degree,free/reduced,none,group1,NaN,NaN,NaN
4,male,group C,some college,standard,none,group1,NaN,NaN,NaN
5,female,group B,associate's degree,standard,none,group1,NaN,NaN,NaN
6,female,group B,some college,standard,completed,group1,NaN,NaN,NaN
7,male,group B,some college,free/reduced,none,group1,NaN,NaN,NaN
8,male,group D,high school,free/reduced,completed,group1,NaN,NaN,NaN
9,female,group B,high school,free/reduced,none,group1,NaN,NaN,NaN

(2000, 9)

#### Задание 3. 

Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [10]:
# your code here
df.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

#### Задание 4. 

Проверьте, есть ли в таблице пропущенные значения

In [11]:
# your code here
df.isna().sum()

gender                         1000
race/ethnicity                 1000
parental level of education    1000
lunch                          1000
test preparation course        1000
group                          1000
math score                     1000
reading score                  1000
writing score                  1000
dtype: int64

In [12]:
df['math score'] = df['math score'].fillna(df['math score'].mean())
df['reading score'] = df['reading score'].fillna(df['reading score'].mean())
df['writing score'] = df['writing score'].fillna(df['writing score'].mean())

#### Задание 5. 

Выведите на экран средние баллы студентов по каждому предмету (math, reading, writing)

In [13]:
# your code here
df.mean()

C:\Users\HP\AppData\Local\Temp\ipykernel_31612\2704427239.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

#### Задание 6. 

Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)? Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.

In [14]:
df.groupby('test preparation course')[['math score', 'reading score', 'writing score']].mean()

                         math score  reading score  writing score
test preparation course
completed                    66.089         69.169         68.054
none                         66.089         69.169         68.054

#### Задание 7. 

Выведите на экран все различные значения из столбца lunch.

In [15]:
# your code here
print(df['lunch'].unique())

['standard' 'free/reduced' nan]

#### Задание 8. 

Переименуйте колонку "parental level of education" в "education", а "test preparation course" в "test preparation" с помощью метода pandas rename
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html

In [16]:
# your code here
df.rename(columns={"parental level of education": "education", "test preparation course": "test preparation"})

,gender,race/ethnicity,education,lunch,test preparation,group,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,group1,66.089,69.169,68.054
1,female,group C,some college,standard,completed,group1,66.089,69.169,68.054
2,female,group B,master's degree,standard,none,group1,66.089,69.169,68.054
3,male,group A,associate's degree,free/reduced,none,group1,66.089,69.169,68.054
4,male,group C,some college,standard,none,group1,66.089,69.169,68.054
...,...,...,...,...,...,...,...,...,...
1995,NaN,NaN,NaN,NaN,NaN,NaN,88.000,99.000,95.000
1996,NaN,NaN,NaN,NaN,NaN,NaN,62.000,55.000,55.000
1997,NaN,NaN,NaN,NaN,NaN,NaN,59.000,71.000,65.000
1998,NaN,NaN,NaN,NaN,NaN,NaN,68.000,78.000,77.000
1999,NaN,NaN,NaN,NaN,NaN,NaN,77.000,86.000,86.000

**Зафиксируем минимальный балл для сдачи экзамена**

In [17]:
passmark = 50

#### Задание 9. 

Ответьте на вопросы:

    * Какая доля студентов сдала экзамен по математике (passmark > 50)?
    * Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
    * Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [18]:
# your code here
print(f"Доля студентов, сдавших экзамен по математике - {len(df[df['math score'] > passmark]) / len(df)}")
print(f"Доля студентов, прошедших курс подготовки и сдавших экзамен по математике - {len(df[(df['math score'] > passmark) & (df['test preparation course'] != 'none')]) / len(df)}")
print(f"Доля женщин, не прошедших курс подготовки и не сдавших экзамен по математике - {len(df[(df['gender'] == 'female') & (df['test preparation course'] != 'completed') & (df['math score'] < passmark)]) / len(df)}")

Доля студентов, сдавших экзамен по математике - 0.925
Доля студентов, прошедших курс подготовки и сдавших экзамен по математике - 0.604
Доля женщин, не прошедших курс подготовки и не сдавших экзамен по математике - 0.0

#### Задание 10. 

С помощью groupby выполните задания ниже. Также выведите время выполнения каждого из заданий.

    * Для каждой этнической группы выведите средний балл за экзамен по чтению
    * Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [19]:
%%time
# your code here
display(df.groupby('race/ethnicity')['reading score'].mean().reset_index())
display(df.groupby('parental level of education')['writing score'].min().reset_index())

  race/ethnicity  reading score
0        group A         69.169
1        group B         69.169
2        group C         69.169
3        group D         69.169
4        group E         69.169

  parental level of education  writing score
0          associate's degree         68.054
1           bachelor's degree         68.054
2                 high school         68.054
3             master's degree         68.054
4                some college         68.054
5            some high school         68.054

CPU times: total: 31.2 ms
Wall time: 24 ms

#### Задание 11.

Выполните задание 10 с помощью циклов. Сравните время выполнения.

In [20]:
%%time

# your code here
average_reading_scores = {}
minimum_writing_scores = {}

for index, row in df.iterrows():
   ethnicity = row['race/ethnicity']
   education = row['parental level of education']
   reading_score = row['reading score']
   writing_score = row['writing score']
   
   if ethnicity not in average_reading_scores:
       average_reading_scores[ethnicity] = [reading_score]
   else:
       average_reading_scores[ethnicity].append(reading_score)
       
   if education not in minimum_writing_scores:
       minimum_writing_scores[education] = [writing_score]
   else:
       minimum_writing_scores[education].append(writing_score)
       
for ethnicity, scores in average_reading_scores.items():
   average_reading_scores[ethnicity] = sum(scores) / len(scores)

for education, scores in minimum_writing_scores.items():
   minimum_writing_scores[education] = min(scores)
   
print(average_reading_scores)
print(minimum_writing_scores)

{'group B': 69.1689999999999, 'group C': 69.16900000000035, 'group A': 69.16899999999993, 'group D': 69.16900000000007, 'group E': 69.16899999999991, nan: 69.169}
{"bachelor's degree": 68.054, 'some college': 68.054, "master's degree": 68.054, "associate's degree": 68.054, 'high school': 68.054, 'some high school': 68.054, nan: 10.0}
CPU times: total: 172 ms
Wall time: 171 ms

#### Задание 12. 

Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования. То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выыведите средний балл по каждому из предметов.

Это можно сделать с помощью сводных таблиц (pivot_table). Дополнительно о них почитать можно тут:

https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas

In [27]:
# your code here
pd.pivot_table(df, index = ['gender', 'parental level of education'], values = ['math score', 'reading score', 'writing score'], aggfunc = 'mean')

                                    math score  reading score  writing score
gender parental level of education
female associate's degree               66.089         69.169         68.054
       bachelor's degree                66.089         69.169         68.054
       high school                      66.089         69.169         68.054
       master's degree                  66.089         69.169         68.054
       some college                     66.089         69.169         68.054
       some high school                 66.089         69.169         68.054
male   associate's degree               66.089         69.169         68.054
       bachelor's degree                66.089         69.169         68.054
       high school                      66.089         69.169         68.054
       master's degree                  66.089         69.169         68.054
       some college                     66.089         69.169         68.054
       some high school                 66.089         69.169         68.054

#### Задание 13. 

Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице df под названием Math_PassStatus и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [28]:
# your code here
df['Math_PassStatus'] = ['P' if score >= passmark else 'F' for score in df['math score']]
df['Reading_PassStatus'] = ['P' if score >= passmark else 'F' for score in df['reading score']]
df['Writing_PassStatus'] = ['P' if score >= passmark else 'F' for score in df['writing score']]

In [29]:
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,math score,reading score,writing score,Grade,Math_PassStatus,Reading_PassStatus,Writing_PassStatus
0,female,group B,bachelor's degree,standard,none,group1,66.089,69.169,68.054,D,P,P,P
1,female,group C,some college,standard,completed,group1,66.089,69.169,68.054,D,P,P,P
2,female,group B,master's degree,standard,none,group1,66.089,69.169,68.054,D,P,P,P
3,male,group A,associate's degree,free/reduced,none,group1,66.089,69.169,68.054,D,P,P,P
4,male,group C,some college,standard,none,group1,66.089,69.169,68.054,D,P,P,P
...,...,...,...,...,...,...,...,...,...,...,...,...,...
1995,NaN,NaN,NaN,NaN,NaN,NaN,88.000,99.000,95.000,A,P,P,P
1996,NaN,NaN,NaN,NaN,NaN,NaN,62.000,55.000,55.000,E,P,P,P
1997,NaN,NaN,NaN,NaN,NaN,NaN,59.000,71.000,65.000,D,P,P,P
1998,NaN,NaN,NaN,NaN,NaN,NaN,68.000,78.000,77.000,C,P,P,P
1999,NaN,NaN,NaN,NaN,NaN,NaN,77.000,86.000,86.000,B,P,P,P

In [31]:
display(df['Math_PassStatus'].value_counts())
display(df['Reading_PassStatus'].value_counts())
display(df['Writing_PassStatus'].value_counts())

P    1865
F     135
Name: Math_PassStatus, dtype: int64

P    1910
F      90
Name: Reading_PassStatus, dtype: int64

P    1886
F     114
Name: Writing_PassStatus, dtype: int64

#### Задание 14. 

Сколько студентов успешно сдали все экзамены?

Создайте столбец OverAll_PassStatus и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [35]:
# your code here
def passed_all_exams(row):
   if row['Math_PassStatus'] == 'P' and row['Reading_PassStatus'] == 'P' and row['Writing_PassStatus'] == 'P':
       return 'P'
   else:
       return 'F'

df['OverAll_PassStatus'] = df.apply(passed_all_exams, axis=1)

In [36]:
df['OverAll_PassStatus'].value_counts()

P    1812
F     188
Name: OverAll_PassStatus, dtype: int64

#### Задание 15. 

Переведем баллы в оценки

*Система перевода баллов в оценки*

        [90;100] = A
        [80;90) = B
        [70;80) = C
        [60;70) = D
        [50;60) = E
        [0;50) = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец Grade и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

In [24]:
def GetGrade(average_mark):
   if 90 <= average_mark <= 100:
       return 'A'
   elif 80 <= average_mark < 90:
       return 'B'
   elif 70 <= average_mark < 80:
       return 'C'
   elif 60 <= average_mark < 70:
       return 'D'
   elif 50 <= average_mark < 60:
       return 'E'
   else:
       return 'F'

In [25]:
df['Grade'] = df[['math score', 'reading score', 'writing score']].mean(axis=1).apply(GetGrade)

grade_counts = df['Grade'].value_counts()
print(grade_counts)

D    1256
C     261
E     182
B     146
F     103
A      52
Name: Grade, dtype: int64